Revit 2024 API
Connector.Id Property
 A unique identifier to identify this connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public int Id { get; }
Visual Basic
Public ReadOnly Property Id As Integer
	Get
Visual C++
public:
property int Id {
	int get ();
}
See Also
Connector Class
Autodesk.Revit.DB Namespace